# RevitLinkOptions Constructor (Boolean) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitLinkOptions Constructor (Boolean)
RevitLinkOptions Class See Also
---
Creates a RevitLinkOptions object, specifying relative or absolute path type. If the link is workshared, all worksets will be opened.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public RevitLinkOptions(
	bool relative
)
```

Visual Basic
---
```text
Public Sub New ( _
	relative As Boolean _
)
```

Visual C++
---
```text
public:
RevitLinkOptions(
	bool relative
)
```

# ### Parameters
relative
    Type: System..::..Boolean True if the link should use a relative path. False if it should use an absolute path.
# See Also
RevitLinkOptions Class
RevitLinkOptions Overload
Autodesk.Revit.DB Namespace